
test:     file format elf64-x86-64

Contents of the .eh_frame section:

00000000 00000014 00000000 CIE
  Version:               1
  Augmentation:          "zR"
  Code alignment factor: 1
  Data alignment factor: -8
  Return address column: 16
  Augmentation data:     1b

  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_offset: r16 (rip) at cfa-8
  DW_CFA_nop
  DW_CFA_nop

00000018 0000001c 0000001c FDE cie=00000000 pc=fffffffffffffe4c..fffffffffffffe8f
  DW_CFA_advance_loc: 1 to fffffffffffffe4d
  DW_CFA_def_cfa_offset: 16
  DW_CFA_advance_loc: 3 to fffffffffffffe50
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000038 0000001c 0000003c FDE cie=00000000 pc=fffffffffffffe8f..fffffffffffffebc
  DW_CFA_advance_loc: 1 to fffffffffffffe90
  DW_CFA_def_cfa_offset: 16
  DW_CFA_advance_loc: 3 to fffffffffffffe93
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000058 00000014 0000005c FDE cie=00000000 pc=fffffffffffffec8..fffffffffffffeca
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000070 00000024 00000074 FDE cie=00000000 pc=fffffffffffffed8..ffffffffffffff61
  DW_CFA_advance_loc: 17 to fffffffffffffee9
  DW_CFA_offset: r12 (r12) at cfa-40
  DW_CFA_offset: r6 (rbp) at cfa-48
  DW_CFA_advance_loc: 31 to ffffffffffffff08
  DW_CFA_def_cfa_offset: 64
  DW_CFA_advance_loc: 6 to ffffffffffffff0e
  DW_CFA_offset: r3 (rbx) at cfa-56
  DW_CFA_offset: r15 (r15) at cfa-16
  DW_CFA_offset: r14 (r14) at cfa-24
  DW_CFA_offset: r13 (r13) at cfa-32
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000098 ZERO terminator


Contents of the .debug_aranges section:

  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x0
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    0000000000400524 0000000000000070 
    0000000000000000 0000000000000000 

Contents of the .debug_pubnames section:

  Length:                              436
  Version:                             2
  Offset into .debug_info section:     0x0
  Size of area in .debug_info section: 1136

    Offset	Name
    194   	someFunc
    1e2   	main
    23a   	sys_call_table
    250   	list_head
    266   	some_char
    27c   	some_uchar
    292   	some_int
    2a8   	some_unit
    2be   	some_long
    2d4   	some_ulong
    2ea   	some_float
    300   	some_double
    316   	some_const_int
    331   	some_pint
    34d   	void_pointer
    363   	some_int_typedef_inst
    379   	some_struct_inst
    38f   	some_struct_typedef_inst
    3a5   	some_struct_double_name
    3bb   	some_double_name
    3e1   	int_array10
    407   	int_array3
    41d   	string
    443   	char_array
    459   	some_enum_inst

Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x46c (32-bit)
   Version:       2
   Abbrev Offset: 0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    < c>   DW_AT_producer    : (indirect string, offset: 0x48): GNU C 4.4.3	
    <10>   DW_AT_language    : 1	(ANSI C)
    <11>   DW_AT_name        : (indirect string, offset: 0xb8): test.c	
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x72): /home/chrschn/qtc-workspace/memtool/tests	
    <19>   DW_AT_low_pc      : 0x400524	
    <21>   DW_AT_high_pc     : 0x400594	
    <29>   DW_AT_stmt_list   : 0x0	
 <1><2d>: Abbrev Number: 2 (DW_TAG_base_type)
    <2e>   DW_AT_byte_size   : 8	
    <2f>   DW_AT_encoding    : 7	(unsigned)
    <30>   DW_AT_name        : (indirect string, offset: 0x2d): long unsigned int	
 <1><34>: Abbrev Number: 2 (DW_TAG_base_type)
    <35>   DW_AT_byte_size   : 1	
    <36>   DW_AT_encoding    : 8	(unsigned char)
    <37>   DW_AT_name        : (indirect string, offset: 0x1a9): unsigned char	
 <1><3b>: Abbrev Number: 2 (DW_TAG_base_type)
    <3c>   DW_AT_byte_size   : 2	
    <3d>   DW_AT_encoding    : 7	(unsigned)
    <3e>   DW_AT_name        : (indirect string, offset: 0x103): short unsigned int	
 <1><42>: Abbrev Number: 2 (DW_TAG_base_type)
    <43>   DW_AT_byte_size   : 4	
    <44>   DW_AT_encoding    : 7	(unsigned)
    <45>   DW_AT_name        : (indirect string, offset: 0x32): unsigned int	
 <1><49>: Abbrev Number: 2 (DW_TAG_base_type)
    <4a>   DW_AT_byte_size   : 1	
    <4b>   DW_AT_encoding    : 6	(signed char)
    <4c>   DW_AT_name        : (indirect string, offset: 0x1ab): signed char	
 <1><50>: Abbrev Number: 2 (DW_TAG_base_type)
    <51>   DW_AT_byte_size   : 2	
    <52>   DW_AT_encoding    : 5	(signed)
    <53>   DW_AT_name        : (indirect string, offset: 0x1d1): short int	
 <1><57>: Abbrev Number: 3 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 4	
    <59>   DW_AT_encoding    : 5	(signed)
    <5a>   DW_AT_name        : int	
 <1><5e>: Abbrev Number: 2 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 8	
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x69): long int	
 <1><65>: Abbrev Number: 4 (DW_TAG_base_type)
    <66>   DW_AT_byte_size   : 8	
    <67>   DW_AT_encoding    : 7	(unsigned)
 <1><68>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <69>   DW_AT_byte_size   : 8	
 <1><6a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <6b>   DW_AT_byte_size   : 8	
    <6c>   DW_AT_type        : <0x70>	
 <1><70>: Abbrev Number: 2 (DW_TAG_base_type)
    <71>   DW_AT_byte_size   : 1	
    <72>   DW_AT_encoding    : 6	(signed char)
    <73>   DW_AT_name        : (indirect string, offset: 0x1b2): char	
 <1><77>: Abbrev Number: 2 (DW_TAG_base_type)
    <78>   DW_AT_byte_size   : 8	
    <79>   DW_AT_encoding    : 5	(signed)
    <7a>   DW_AT_name        : (indirect string, offset: 0x64): long long int	
 <1><7e>: Abbrev Number: 2 (DW_TAG_base_type)
    <7f>   DW_AT_byte_size   : 8	
    <80>   DW_AT_encoding    : 7	(unsigned)
    <81>   DW_AT_name        : (indirect string, offset: 0x28): long long unsigned int	
 <1><85>: Abbrev Number: 7 (DW_TAG_typedef)
    <86>   DW_AT_name        : (indirect string, offset: 0x116): sys_call_ptr_t	
    <8a>   DW_AT_decl_file   : 1	
    <8b>   DW_AT_decl_line   : 12	
    <8c>   DW_AT_type        : <0x90>	
 <1><90>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <91>   DW_AT_byte_size   : 8	
    <92>   DW_AT_type        : <0x96>	
 <1><96>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <97>   DW_AT_prototyped  : 1	
 <1><98>: Abbrev Number: 9 (DW_TAG_structure_type)
    <99>   DW_AT_name        : (indirect string, offset: 0x9c): Node	
    <9d>   DW_AT_byte_size   : 24	
    <9e>   DW_AT_decl_file   : 1	
    <9f>   DW_AT_decl_line   : 25	
    <a0>   DW_AT_sibling     : <0xcd>	
 <2><a4>: Abbrev Number: 10 (DW_TAG_member)
    <a5>   DW_AT_name        : i	
    <a7>   DW_AT_decl_file   : 1	
    <a8>   DW_AT_decl_line   : 28	
    <a9>   DW_AT_type        : <0x57>	
    <ad>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><b0>: Abbrev Number: 11 (DW_TAG_member)
    <b1>   DW_AT_name        : (indirect string, offset: 0x15): prev	
    <b5>   DW_AT_decl_file   : 1	
    <b6>   DW_AT_decl_line   : 29	
    <b7>   DW_AT_type        : <0xcd>	
    <bb>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><be>: Abbrev Number: 11 (DW_TAG_member)
    <bf>   DW_AT_name        : (indirect string, offset: 0x54): next	
    <c3>   DW_AT_decl_file   : 1	
    <c4>   DW_AT_decl_line   : 29	
    <c5>   DW_AT_type        : <0xcd>	
    <c9>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <1><cd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ce>   DW_AT_byte_size   : 8	
    <cf>   DW_AT_type        : <0x98>	
 <1><d3>: Abbrev Number: 7 (DW_TAG_typedef)
    <d4>   DW_AT_name        : (indirect string, offset: 0x1c5): int_typedef	
    <d8>   DW_AT_decl_file   : 1	
    <d9>   DW_AT_decl_line   : 47	
    <da>   DW_AT_type        : <0x57>	
 <1><de>: Abbrev Number: 12 (DW_TAG_structure_type)
    <df>   DW_AT_byte_size   : 16	
    <e0>   DW_AT_decl_file   : 1	
    <e1>   DW_AT_decl_line   : 50	
    <e2>   DW_AT_sibling     : <0x111>	
 <2><e6>: Abbrev Number: 11 (DW_TAG_member)
    <e7>   DW_AT_name        : (indirect string, offset: 0x252): struct_int	
    <eb>   DW_AT_decl_file   : 1	
    <ec>   DW_AT_decl_line   : 51	
    <ed>   DW_AT_type        : <0x57>	
    <f1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><f4>: Abbrev Number: 11 (DW_TAG_member)
    <f5>   DW_AT_name        : (indirect string, offset: 0x215): struct_char	
    <f9>   DW_AT_decl_file   : 1	
    <fa>   DW_AT_decl_line   : 52	
    <fb>   DW_AT_type        : <0x70>	
    <ff>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><102>: Abbrev Number: 11 (DW_TAG_member)
    <103>   DW_AT_name        : (indirect string, offset: 0xa1): struct_long	
    <107>   DW_AT_decl_file   : 1	
    <108>   DW_AT_decl_line   : 53	
    <109>   DW_AT_type        : <0x5e>	
    <10d>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <1><111>: Abbrev Number: 12 (DW_TAG_structure_type)
    <112>   DW_AT_byte_size   : 16	
    <113>   DW_AT_decl_file   : 1	
    <114>   DW_AT_decl_line   : 63	
    <115>   DW_AT_sibling     : <0x136>	
 <2><119>: Abbrev Number: 11 (DW_TAG_member)
    <11a>   DW_AT_name        : (indirect string, offset: 0x1a): tstruct_float	
    <11e>   DW_AT_decl_file   : 1	
    <11f>   DW_AT_decl_line   : 64	
    <120>   DW_AT_type        : <0x136>	
    <124>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><127>: Abbrev Number: 11 (DW_TAG_member)
    <128>   DW_AT_name        : (indirect string, offset: 0xce): tstruct_double	
    <12c>   DW_AT_decl_file   : 1	
    <12d>   DW_AT_decl_line   : 65	
    <12e>   DW_AT_type        : <0x13d>	
    <132>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <1><136>: Abbrev Number: 2 (DW_TAG_base_type)
    <137>   DW_AT_byte_size   : 4	
    <138>   DW_AT_encoding    : 4	(float)
    <139>   DW_AT_name        : (indirect string, offset: 0x5): float	
 <1><13d>: Abbrev Number: 2 (DW_TAG_base_type)
    <13e>   DW_AT_byte_size   : 8	
    <13f>   DW_AT_encoding    : 4	(float)
    <140>   DW_AT_name        : (indirect string, offset: 0x168): double	
 <1><144>: Abbrev Number: 7 (DW_TAG_typedef)
    <145>   DW_AT_name        : (indirect string, offset: 0xdd): struct_typedef	
    <149>   DW_AT_decl_file   : 1	
    <14a>   DW_AT_decl_line   : 66	
    <14b>   DW_AT_type        : <0x111>	
 <1><14f>: Abbrev Number: 9 (DW_TAG_structure_type)
    <150>   DW_AT_name        : (indirect string, offset: 0x192): _double_name	
    <154>   DW_AT_byte_size   : 4	
    <155>   DW_AT_decl_file   : 1	
    <156>   DW_AT_decl_line   : 70	
    <157>   DW_AT_sibling     : <0x16a>	
 <2><15b>: Abbrev Number: 11 (DW_TAG_member)
    <15c>   DW_AT_name        : (indirect string, offset: 0x251): dstruct_int	
    <160>   DW_AT_decl_file   : 1	
    <161>   DW_AT_decl_line   : 71	
    <162>   DW_AT_type        : <0x57>	
    <166>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <1><16a>: Abbrev Number: 7 (DW_TAG_typedef)
    <16b>   DW_AT_name        : (indirect string, offset: 0x193): double_name	
    <16f>   DW_AT_decl_file   : 1	
    <170>   DW_AT_decl_line   : 72	
    <171>   DW_AT_type        : <0x14f>	
 <1><175>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <176>   DW_AT_name        : (indirect string, offset: 0x3f): SomeEnum	
    <17a>   DW_AT_byte_size   : 4	
    <17b>   DW_AT_decl_file   : 1	
    <17c>   DW_AT_decl_line   : 89	
    <17d>   DW_AT_sibling     : <0x194>	
 <2><181>: Abbrev Number: 14 (DW_TAG_enumerator)
    <182>   DW_AT_name        : (indirect string, offset: 0xec): seOne	
    <186>   DW_AT_const_value : 0	
 <2><187>: Abbrev Number: 14 (DW_TAG_enumerator)
    <188>   DW_AT_name        : (indirect string, offset: 0x17e): seTwo	
    <18c>   DW_AT_const_value : 1	
 <2><18d>: Abbrev Number: 14 (DW_TAG_enumerator)
    <18e>   DW_AT_name        : (indirect string, offset: 0xfb): seThree	
    <192>   DW_AT_const_value : 2	
 <1><194>: Abbrev Number: 15 (DW_TAG_subprogram)
    <195>   DW_AT_external    : 1	
    <196>   DW_AT_name        : (indirect string, offset: 0xf2): someFunc	
    <19a>   DW_AT_decl_file   : 1	
    <19b>   DW_AT_decl_line   : 17	
    <19c>   DW_AT_prototyped  : 1	
    <19d>   DW_AT_type        : <0x57>	
    <1a1>   DW_AT_low_pc      : 0x400524	
    <1a9>   DW_AT_high_pc     : 0x400567	
    <1b1>   DW_AT_frame_base  : 0x0	(location list)
    <1b5>   DW_AT_sibling     : <0x1e2>	
 <2><1b9>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <1ba>   DW_AT_name        : (indirect string, offset: 0x1b7): param1	
    <1be>   DW_AT_decl_file   : 1	
    <1bf>   DW_AT_decl_line   : 17	
    <1c0>   DW_AT_type        : <0x57>	
    <1c4>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><1c7>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <1c8>   DW_AT_name        : (indirect string, offset: 0x1be): param2	
    <1cc>   DW_AT_decl_file   : 1	
    <1cd>   DW_AT_decl_line   : 17	
    <1ce>   DW_AT_type        : <0x6a>	
    <1d2>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><1d5>: Abbrev Number: 17 (DW_TAG_variable)
    <1d6>   DW_AT_name        : i	
    <1d8>   DW_AT_decl_file   : 1	
    <1d9>   DW_AT_decl_line   : 19	
    <1da>   DW_AT_type        : <0x57>	
    <1de>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <1><1e2>: Abbrev Number: 15 (DW_TAG_subprogram)
    <1e3>   DW_AT_external    : 1	
    <1e4>   DW_AT_name        : (indirect string, offset: 0x279): main	
    <1e8>   DW_AT_decl_file   : 1	
    <1e9>   DW_AT_decl_line   : 96	
    <1ea>   DW_AT_prototyped  : 1	
    <1eb>   DW_AT_type        : <0x57>	
    <1ef>   DW_AT_low_pc      : 0x400567	
    <1f7>   DW_AT_high_pc     : 0x400594	
    <1ff>   DW_AT_frame_base  : 0x4c	(location list)
    <203>   DW_AT_sibling     : <0x224>	
 <2><207>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <208>   DW_AT_name        : (indirect string, offset: 0x268): argc	
    <20c>   DW_AT_decl_file   : 1	
    <20d>   DW_AT_decl_line   : 96	
    <20e>   DW_AT_type        : <0x57>	
    <212>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><215>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <216>   DW_AT_name        : (indirect string, offset: 0x24c): argv	
    <21a>   DW_AT_decl_file   : 1	
    <21b>   DW_AT_decl_line   : 96	
    <21c>   DW_AT_type        : <0x224>	
    <220>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <1><224>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <225>   DW_AT_byte_size   : 8	
    <226>   DW_AT_type        : <0x6a>	
 <1><22a>: Abbrev Number: 18 (DW_TAG_array_type)
    <22b>   DW_AT_type        : <0x85>	
    <22f>   DW_AT_sibling     : <0x23a>	
 <2><233>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <234>   DW_AT_type        : <0x65>	
    <238>   DW_AT_upper_bound : 2	
 <1><23a>: Abbrev Number: 20 (DW_TAG_variable)
