
test:     file format elf64-x86-64

Contents of the .eh_frame section:

00000000 00000014 00000000 CIE
  Version:               1
  Augmentation:          "zR"
  Code alignment factor: 1
  Data alignment factor: -8
  Return address column: 16
  Augmentation data:     1b

  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_offset: r16 (rip) at cfa-8
  DW_CFA_nop
  DW_CFA_nop

00000018 0000001c 0000001c FDE cie=00000000 pc=fffffffffffffe4c..fffffffffffffe8f
  DW_CFA_advance_loc: 1 to fffffffffffffe4d
  DW_CFA_def_cfa_offset: 16
  DW_CFA_advance_loc: 3 to fffffffffffffe50
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000038 0000001c 0000003c FDE cie=00000000 pc=fffffffffffffe8f..fffffffffffffebc
  DW_CFA_advance_loc: 1 to fffffffffffffe90
  DW_CFA_def_cfa_offset: 16
  DW_CFA_advance_loc: 3 to fffffffffffffe93
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000058 00000014 0000005c FDE cie=00000000 pc=fffffffffffffec8..fffffffffffffeca
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000070 00000024 00000074 FDE cie=00000000 pc=fffffffffffffed8..ffffffffffffff61
  DW_CFA_advance_loc: 17 to fffffffffffffee9
  DW_CFA_offset: r12 (r12) at cfa-40
  DW_CFA_offset: r6 (rbp) at cfa-48

    <a3>   DW_AT_name        : (indirect string, offset: 0x20): short unsigned int	
 <1><a7>: Abbrev Number: 2 (DW_TAG_base_type)
    <a8>   DW_AT_byte_size   : 4	
    <a9>   DW_AT_encoding    : 7	(unsigned)
    <aa>   DW_AT_name        : (indirect string, offset: 0x1a4): unsigned int	
 <1><ae>: Abbrev Number: 2 (DW_TAG_base_type)
    <af>   DW_AT_byte_size   : 8	
    <b0>   DW_AT_encoding    : 7	(unsigned)
    <b1>   DW_AT_name        : (indirect string, offset: 0x19f): long unsigned int	
 <1><b5>: Abbrev Number: 2 (DW_TAG_base_type)
    <b6>   DW_AT_byte_size   : 1	
    <b7>   DW_AT_encoding    : 6	(signed char)
    <b8>   DW_AT_name        : (indirect string, offset: 0x5a): signed char	
 <1><bc>: Abbrev Number: 2 (DW_TAG_base_type)
    <bd>   DW_AT_byte_size   : 2	
    <be>   DW_AT_encoding    : 5	(signed)
    <bf>   DW_AT_name        : (indirect string, offset: 0x3f): short int	
 <1><c3>: Abbrev Number: 3 (DW_TAG_base_type)
    <c4>   DW_AT_byte_size   : 4	
    <c5>   DW_AT_encoding    : 5	(signed)
    <c6>   DW_AT_name        : int	
 <1><ca>: Abbrev Number: 2 (DW_TAG_base_type)
    <cb>   DW_AT_byte_size   : 8	
    <cc>   DW_AT_encoding    : 5	(signed)
    <cd>   DW_AT_name        : (indirect string, offset: 0x72): long int	
 <1><d1>: Abbrev Number: 4 (DW_TAG_base_type)
    <d2>   DW_AT_byte_size   : 8	
    <d3>   DW_AT_encoding    : 7	(unsigned)
 <1><d4>: Abbrev Number: 2 (DW_TAG_base_type)
    <d5>   DW_AT_byte_size   : 1	
    <d6>   DW_AT_encoding    : 6	(signed char)
    <d7>   DW_AT_name        : (indirect string, offset: 0x61): char	
 <1><db>: Abbrev Number: 5 (DW_TAG_variable)
    <dc>   DW_AT_name        : (indirect string, offset: 0x49): _IO_stdin_used	
    <e0>   DW_AT_decl_file   : 1	
    <e1>   DW_AT_decl_line   : 25	
    <e2>   DW_AT_type        : <0xf1>	
    <e6>   DW_AT_external    : 1	
    <e7>   DW_AT_location    : 9 byte block: 3 88 6 40 0 0 0 0 0 	(DW_OP_addr: 400688)
 <1><f1>: Abbrev Number: 6 (DW_TAG_const_type)
    <f2>   DW_AT_type        : <0xc3>	
  Compilation Unit @ offset 0xf7:
   Length:        0x454 (32-bit)
   Version:       2
   Abbrev Offset: 95
   Pointer Size:  8
 <0><102>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <103>   DW_AT_producer    : (indirect string, offset: 0x33): GNU C 4.4.1	
    <107>   DW_AT_language    : 1	(ANSI C)
    <108>   DW_AT_name        : (indirect string, offset: 0xac): test.c	
    <10c>   DW_AT_comp_dir    : (indirect string, offset: 0x20c): /home/chrschn/qtc-workspace/memtool/tests	
    <110>   DW_AT_low_pc      : 0x400524	
    <118>   DW_AT_high_pc     : 0x400594	
    <120>   DW_AT_stmt_list   : 0x88	
 <1><124>: Abbrev Number: 2 (DW_TAG_base_type)
    <125>   DW_AT_byte_size   : 8	
    <126>   DW_AT_encoding    : 7	(unsigned)
    <127>   DW_AT_name        : (indirect string, offset: 0x19f): long unsigned int	
 <1><12b>: Abbrev Number: 2 (DW_TAG_base_type)
    <12c>   DW_AT_byte_size   : 1	
    <12d>   DW_AT_encoding    : 8	(unsigned char)
    <12e>   DW_AT_name        : (indirect string, offset: 0x58): unsigned char	
 <1><132>: Abbrev Number: 2 (DW_TAG_base_type)
    <133>   DW_AT_byte_size   : 2	
    <134>   DW_AT_encoding    : 7	(unsigned)
    <135>   DW_AT_name        : (indirect string, offset: 0x20): short unsigned int	
 <1><139>: Abbrev Number: 2 (DW_TAG_base_type)
    <13a>   DW_AT_byte_size   : 4	
    <13b>   DW_AT_encoding    : 7	(unsigned)
    <13c>   DW_AT_name        : (indirect string, offset: 0x1a4): unsigned int	
 <1><140>: Abbrev Number: 2 (DW_TAG_base_type)
    <141>   DW_AT_byte_size   : 1	
    <142>   DW_AT_encoding    : 6	(signed char)
    <143>   DW_AT_name        : (indirect string, offset: 0x5a): signed char	
 <1><147>: Abbrev Number: 2 (DW_TAG_base_type)
    <148>   DW_AT_byte_size   : 2	
    <149>   DW_AT_encoding    : 5	(signed)
    <14a>   DW_AT_name        : (indirect string, offset: 0x3f): short int	
 <1><14e>: Abbrev Number: 3 (DW_TAG_base_type)
    <14f>   DW_AT_byte_size   : 4	
    <150>   DW_AT_encoding    : 5	(signed)
    <151>   DW_AT_name        : int	
 <1><155>: Abbrev Number: 2 (DW_TAG_base_type)
    <156>   DW_AT_byte_size   : 8	
    <157>   DW_AT_encoding    : 5	(signed)
    <158>   DW_AT_name        : (indirect string, offset: 0x72): long int	
 <1><15c>: Abbrev Number: 4 (DW_TAG_base_type)
    <15d>   DW_AT_byte_size   : 8	
    <15e>   DW_AT_encoding    : 7	(unsigned)
 <1><15f>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <160>   DW_AT_byte_size   : 8	
    <161>   DW_AT_type        : <0x165>	
 <1><165>: Abbrev Number: 2 (DW_TAG_base_type)
    <166>   DW_AT_byte_size   : 1	
    <167>   DW_AT_encoding    : 6	(signed char)
    <168>   DW_AT_name        : (indirect string, offset: 0x61): char	
 <1><16c>: Abbrev Number: 2 (DW_TAG_base_type)
    <16d>   DW_AT_byte_size   : 8	
    <16e>   DW_AT_encoding    : 5	(signed)
    <16f>   DW_AT_name        : (indirect string, offset: 0x6d): long long int	
 <1><173>: Abbrev Number: 2 (DW_TAG_base_type)
    <174>   DW_AT_byte_size   : 8	
    <175>   DW_AT_encoding    : 7	(unsigned)
    <176>   DW_AT_name        : (indirect string, offset: 0x19a): long long unsigned int	
 <1><17a>: Abbrev Number: 6 (DW_TAG_typedef)
    <17b>   DW_AT_name        : (indirect string, offset: 0x236): sys_call_ptr_t	
    <17f>   DW_AT_decl_file   : 1	
    <180>   DW_AT_decl_line   : 12	
    <181>   DW_AT_type        : <0x185>	
 <1><185>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <186>   DW_AT_byte_size   : 8	
    <187>   DW_AT_type        : <0x18b>	
 <1><18b>: Abbrev Number: 7 (DW_TAG_subroutine_type)
    <18c>   DW_AT_prototyped  : 1	
 <1><18d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <18e>   DW_AT_name        : (indirect string, offset: 0x7b): Node	
    <192>   DW_AT_byte_size   : 24	
    <193>   DW_AT_decl_file   : 1	
    <194>   DW_AT_decl_line   : 25	
    <195>   DW_AT_sibling     : <0x1c2>	
 <2><199>: Abbrev Number: 9 (DW_TAG_member)
    <19a>   DW_AT_name        : i	
    <19c>   DW_AT_decl_file   : 1	
    <19d>   DW_AT_decl_line   : 28	
    <19e>   DW_AT_type        : <0x14e>	
    <1a2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1a5>: Abbrev Number: 10 (DW_TAG_member)
    <1a6>   DW_AT_name        : (indirect string, offset: 0x2a2): prev	
    <1aa>   DW_AT_decl_file   : 1	
    <1ab>   DW_AT_decl_line   : 29	
    <1ac>   DW_AT_type        : <0x1c2>	
    <1b0>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1b3>: Abbrev Number: 10 (DW_TAG_member)
    <1b4>   DW_AT_name        : (indirect string, offset: 0x80): next	
    <1b8>   DW_AT_decl_file   : 1	
    <1b9>   DW_AT_decl_line   : 29	
    <1ba>   DW_AT_type        : <0x1c2>	
    <1be>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <1><1c2>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1c3>   DW_AT_byte_size   : 8	
    <1c4>   DW_AT_type        : <0x18d>	
 <1><1c8>: Abbrev Number: 6 (DW_TAG_typedef)
    <1c9>   DW_AT_name        : (indirect string, offset: 0x159): int_typedef	
    <1cd>   DW_AT_decl_file   : 1	
    <1ce>   DW_AT_decl_line   : 46	
    <1cf>   DW_AT_type        : <0x14e>	
 <1><1d3>: Abbrev Number: 11 (DW_TAG_structure_type)
    <1d4>   DW_AT_byte_size   : 16	
    <1d5>   DW_AT_decl_file   : 1	
    <1d6>   DW_AT_decl_line   : 49	
    <1d7>   DW_AT_sibling     : <0x206>	
 <2><1db>: Abbrev Number: 10 (DW_TAG_member)
    <1dc>   DW_AT_name        : (indirect string, offset: 0xf0): struct_int	
    <1e0>   DW_AT_decl_file   : 1	
    <1e1>   DW_AT_decl_line   : 50	
    <1e2>   DW_AT_type        : <0x14e>	
    <1e6>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1e9>: Abbrev Number: 10 (DW_TAG_member)
    <1ea>   DW_AT_name        : (indirect string, offset: 0x165): struct_char	
    <1ee>   DW_AT_decl_file   : 1	
    <1ef>   DW_AT_decl_line   : 51	
    <1f0>   DW_AT_type        : <0x165>	
    <1f4>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1f7>: Abbrev Number: 10 (DW_TAG_member)
    <1f8>   DW_AT_name        : (indirect string, offset: 0x1b1): struct_long	
    <1fc>   DW_AT_decl_file   : 1	
    <1fd>   DW_AT_decl_line   : 52	
    <1fe>   DW_AT_type        : <0x155>	
    <202>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <1><206>: Abbrev Number: 11 (DW_TAG_structure_type)
    <207>   DW_AT_byte_size   : 16	
    <208>   DW_AT_decl_file   : 1	
    <209>   DW_AT_decl_line   : 62	
    <20a>   DW_AT_sibling     : <0x22b>	
 <2><20e>: Abbrev Number: 10 (DW_TAG_member)
    <20f>   DW_AT_name        : (indirect string, offset: 0x245): tstruct_float	
    <213>   DW_AT_decl_file   : 1	
    <214>   DW_AT_decl_line   : 63	
    <215>   DW_AT_type        : <0x22b>	
    <219>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><21c>: Abbrev Number: 10 (DW_TAG_member)
    <21d>   DW_AT_name        : (indirect string, offset: 0x10f): tstruct_double	
    <221>   DW_AT_decl_file   : 1	
    <222>   DW_AT_decl_line   : 64	
    <223>   DW_AT_type        : <0x232>	
    <227>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <1><22b>: Abbrev Number: 2 (DW_TAG_base_type)
    <22c>   DW_AT_byte_size   : 4	
    <22d>   DW_AT_encoding    : 4	(float)
    <22e>   DW_AT_name        : (indirect string, offset: 0xde): float	
 <1><232>: Abbrev Number: 2 (DW_TAG_base_type)
    <233>   DW_AT_byte_size   : 8	
    <234>   DW_AT_encoding    : 4	(float)
    <235>   DW_AT_name        : (indirect string, offset: 0xb8): double	
 <1><239>: Abbrev Number: 6 (DW_TAG_typedef)
    <23a>   DW_AT_name        : (indirect string, offset: 0x284): struct_typedef	
    <23e>   DW_AT_decl_file   : 1	
    <23f>   DW_AT_decl_line   : 65	
    <240>   DW_AT_type        : <0x206>	
 <1><244>: Abbrev Number: 8 (DW_TAG_structure_type)
    <245>   DW_AT_name        : (indirect string, offset: 0x267): _double_name	
    <249>   DW_AT_byte_size   : 4	
    <24a>   DW_AT_decl_file   : 1	
    <24b>   DW_AT_decl_line   : 69	
    <24c>   DW_AT_sibling     : <0x25f>	
 <2><250>: Abbrev Number: 10 (DW_TAG_member)
    <251>   DW_AT_name        : (indirect string, offset: 0xef): dstruct_int	
    <255>   DW_AT_decl_file   : 1	
    <256>   DW_AT_decl_line   : 70	
    <257>   DW_AT_type        : <0x14e>	
    <25b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <1><25f>: Abbrev Number: 6 (DW_TAG_typedef)
    <260>   DW_AT_name        : (indirect string, offset: 0x268): double_name	
    <264>   DW_AT_decl_file   : 1	
    <265>   DW_AT_decl_line   : 71	
    <266>   DW_AT_type        : <0x244>	
 <1><26a>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <26b>   DW_AT_name        : (indirect string, offset: 0x85): SomeEnum	
    <26f>   DW_AT_byte_size   : 4	
    <270>   DW_AT_decl_file   : 1	
    <271>   DW_AT_decl_line   : 88	
    <272>   DW_AT_sibling     : <0x289>	
 <2><276>: Abbrev Number: 13 (DW_TAG_enumerator)
    <277>   DW_AT_name        : (indirect string, offset: 0x142): seOne	
    <27b>   DW_AT_const_value : 0	
 <2><27c>: Abbrev Number: 13 (DW_TAG_enumerator)
    <27d>   DW_AT_name        : (indirect string, offset: 0x128): seTwo	
    <281>   DW_AT_const_value : 1	
 <2><282>: Abbrev Number: 13 (DW_TAG_enumerator)
    <283>   DW_AT_name        : (indirect string, offset: 0x12e): seThree	
    <287>   DW_AT_const_value : 2	
 <1><289>: Abbrev Number: 14 (DW_TAG_subprogram)
    <28a>   DW_AT_external    : 1	
    <28b>   DW_AT_name        : (indirect string, offset: 0x274): someFunc	
    <28f>   DW_AT_decl_file   : 1	
    <290>   DW_AT_decl_line   : 17	
    <291>   DW_AT_prototyped  : 1	
    <292>   DW_AT_type        : <0x14e>	
    <296>   DW_AT_low_pc      : 0x400524	
    <29e>   DW_AT_high_pc     : 0x400567	
    <2a6>   DW_AT_frame_base  : 0x0	(location list)
    <2aa>   DW_AT_sibling     : <0x2d7>	
 <2><2ae>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <2af>   DW_AT_name        : (indirect string, offset: 0x1d3): param1	
    <2b3>   DW_AT_decl_file   : 1	
    <2b4>   DW_AT_decl_line   : 17	
    <2b5>   DW_AT_type        : <0x14e>	
    <2b9>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><2bc>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <2bd>   DW_AT_name        : (indirect string, offset: 0x27d): param2	
    <2c1>   DW_AT_decl_file   : 1	
    <2c2>   DW_AT_decl_line   : 17	
    <2c3>   DW_AT_type        : <0x15f>	
    <2c7>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><2ca>: Abbrev Number: 16 (DW_TAG_variable)
    <2cb>   DW_AT_name        : i	
    <2cd>   DW_AT_decl_file   : 1	
    <2ce>   DW_AT_decl_line   : 19	
    <2cf>   DW_AT_type        : <0x14e>	
    <2d3>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <1><2d7>: Abbrev Number: 14 (DW_TAG_subprogram)
    <2d8>   DW_AT_external    : 1	
    <2d9>   DW_AT_name        : (indirect string, offset: 0x171): main	
    <2dd>   DW_AT_decl_file   : 1	
    <2de>   DW_AT_decl_line   : 95	
    <2df>   DW_AT_prototyped  : 1	
    <2e0>   DW_AT_type        : <0x14e>	
    <2e4>   DW_AT_low_pc      : 0x400567	
    <2ec>   DW_AT_high_pc     : 0x400594	
    <2f4>   DW_AT_frame_base  : 0x4c	(location list)
    <2f8>   DW_AT_sibling     : <0x319>	
 <2><2fc>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <2fd>   DW_AT_name        : (indirect string, offset: 0x1e5): argc	
    <301>   DW_AT_decl_file   : 1	
    <302>   DW_AT_decl_line   : 95	
    <303>   DW_AT_type        : <0x14e>	
    <307>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><30a>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <30b>   DW_AT_name        : (indirect string, offset: 0x253): argv	
    <30f>   DW_AT_decl_file   : 1	
    <310>   DW_AT_decl_line   : 95	
    <311>   DW_AT_type        : <0x319>	
    <315>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <1><319>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <31a>   DW_AT_byte_size   : 8	
    <31b>   DW_AT_type        : <0x15f>	
 <1><31f>: Abbrev Number: 17 (DW_TAG_array_type)
    <320>   DW_AT_type        : <0x17a>	
    <324>   DW_AT_sibling     : <0x32f>	
 <2><328>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <329>   DW_AT_type        : <0x15c>	
    <32d>   DW_AT_upper_bound : 2	
 <1><32f>: Abbrev Number: 19 (DW_TAG_variable)
